Repository: ko31/hello-dolly-translate
Catalog: *.po
Languages: nl_nl

source: Hello, Dolly
nl_nl: Hallo, Grietje

source: Well, hello, Dolly
nl_nl: Wel, hallo, Grietje

source: It's so nice to have you back where you belong
nl_nl: Het is zo fijn om je terug te hebben waar je hoor

source: You're lookin' swell, Dolly
nl_nl: Je ziet er geweldig uit, Grietje

source: I can tell, Dolly
nl_nl: Ik kan het zien, Grietje

source: You're still glowin', you're still crowin
nl_nl: Je straalt nog steeds, je jubelt nog steeds

source: You're still goin' strong
nl_nl: Je gaat nog steeds goed

source: We feel the room swayin
nl_nl: We voelen de kamer bewegen

source: While the band's playin
nl_nl: Terwijl de band speelt

source: One of your old favourite songs from way back when
nl_nl: Een van je oude, favoriete liedjes van toen

source: So, take her wrap, fellas
nl_nl: Dus, neem haar sjaal, jongens

source: Find her an empty lap, fellas
nl_nl: Vindt haar een lege schoot, jongens

source: Dolly'll never go away again
nl_nl: Grietje gaat nooit meer weg

source: You're still glowin', you're still crowin'
nl_nl: Je straalt nog steeds, je jubelt nog steeds

source: We feel the room swayin'
nl_nl: We voelen de kamer bewegen

source: While the band's playin'
nl_nl: Terwijl de band speelt

source: Golly, gee, fellas
nl_nl: Nou, tjonge, jongens

source: Find her a vacant knee, fellas
nl_nl: Vindt haar een onbezette knie, jongens

source: Dolly'll never go away
nl_nl: Grietje gaat nooit meer weg
