Repository: ko31/hello-dolly-translate
Catalog: languages/hello-dolly-translate-*.po
Languages: af_za, es_es

source: Hello, Dolly
af_za: Hallo, Grietjie
es_es: Hola, Lola

source: Well, hello, Dolly
af_za: Hallo, Grietjie
es_es: Que tal, Lola

source: It's so nice to have you back where you belong
af_za: Dis lekker om jou weer te sien
es_es: Es bueno que tenerte en el propio placer

source: You're lookin' swell, Dolly
af_za: Jy lyk uitstekend, Grietjie
es_es: Te ves bien, Lola

source: I can tell, Dolly
af_za: Ek sien jou raak, Grietjie
es_es: Puedo ver, Lola

source: You're still glowin', you're still crowin
af_za: Jy lyk gloeiend, jy lyk stralend
es_es: Que estás radiante, que estás cantando

source: You're still goin' strong
af_za: Jy staan steeds sterk
es_es: Que vas a quedar fuerte.

source: We feel the room swayin
af_za: Ons voel die kamer draai
es_es: Sentimos el movimiento del espacio

source: While the band's playin
af_za: Terwyl die orkes speel
es_es: Mientras que la banda está tocando

source: One of your old favourite songs from way back when
af_za: Een van jou ou gunsteling liedjies
es_es: Una de sus canciones favoritas del pasado.

source: So, take her wrap, fellas
af_za: So, vat haar saam, vrinne
es_es: Tome su chal, amigos

source: Find her an empty lap, fellas
af_za: Kry vir haar 'n skoot, vrinne
es_es: Encontrarla un regazo vacío, amigos

source: Dolly'll never go away again
af_za: Grietjie gaan nie weg nie.
es_es: Lola nunca desaparecerá otra vez

source: You're still glowin', you're still crowin'
af_za: Jy lyk gloeiend, jy lyk stralend
es_es: Que estás radiante, que estás cantando

source: We feel the room swayin'
af_za: Ons voel die kamer draai
es_es: Sentimos el movimiento del espacio

source: While the band's playin'
af_za: Terwyl die orkes speel
es_es: Mientras que la banda está tocando

source: Golly, gee, fellas
af_za: Goeie Grietjie, vrinne
es_es: Ay Dios, amigos

source: Find her a vacant knee, fellas
af_za: Kry vir haar 'n knie, vrinne
es_es: Encontrarla una rodilla vacío, amigos

source: Dolly'll never go away
af_za: Grietjie gaan nie weg nie.
es_es: Lola nunca desaparecerá
